# [ DataFrame 인덱스 다루기 ]

## (1) 새로운 인덱스 설정 : 컬럼 ==> 인덱스 설정

### <hr> (1) 모듈로딩

In [85]:
import pandas as pd

### <hr> (2) 데이터 준비

In [86]:
# dict 타입의 데이터 생성
exam = { '이름' : ['김재중', '김현아', '조현아', '이창민'],
         '국어' : [78, 89 , 99, 29],
         '수학' : [97, 49 , 89, 99],
         '영어' : [98, 89 , 39, 49],
         '과학' : [98, 89 , 79, 89] }

### <hr> (3) 데이터 저장

In [87]:
examDF=pd.DataFrame(exam)

### <hr> (4) 데이터 확인

In [88]:
examDF

    이름  국어  수학  영어  과학
0  김재중  78  97  98  98
1  김현아  89  49  89  89
2  조현아  99  89  39  79
3  이창민  29  99  49  89

- 행 데이터 추가

In [89]:
# 김재중 78 97 98 98
# 원본에 행 추가해서 값을 수정
examDF.loc[4] = ['김재중', 78, 97, 58, 98] # 국어 과학 원본과 같음

In [90]:
# 김재중 78 52 35 63
examDF.loc[5] = ['김재중', 78, 34, 89, 62] # 국어-김재중 김현아-영어 원본과 같음

In [91]:
examDF

    이름  국어  수학  영어  과학
0  김재중  78  97  98  98
1  김현아  89  49  89  89
2  조현아  99  89  39  79
3  이창민  29  99  49  89
4  김재중  78  97  58  98
5  김재중  78  34  89  62

### <hr> (5) 새로운 인덱스 설정 방법 3

방법 3. 멀티인덱스 제어 DF.set_index([컬럼1, 컬럼2, ..., 컬럼n]

In [92]:
# 이름, 국어, 수학을 인덱스 설정
examDF1 = examDF.set_index(['이름', '국어', '수학'])
examDF1
# 맨 하단 김재중 78은 바로 위 김재중 78과 같아서 안 나오는 것

           영어  과학
이름  국어 수학
김재중 78 97  98  98
김현아 89 49  89  89
조현아 99 89  39  79
이창민 29 99  49  89
김재중 78 97  58  98
       34  89  62

In [93]:
# 인덱스 속성 확인
examDF1.index

MultiIndex([('김재중', 78, 97),
            ('김현아', 89, 49),
            ('조현아', 99, 89),
            ('이창민', 29, 99),
            ('김재중', 78, 97),
            ('김재중', 78, 34)],
           names=['이름', '국어', '수학'])

- 행 데이터 선택 : DF객체변수명.loc[행레이블] / DF객체변수명.iloc[위치인덱스]

In [94]:
examDF1.loc[('김재중', 78, 97)]

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_21756/3056540236.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF1.loc[('김재중', 78, 97)]

           영어  과학
이름  국어 수학
김재중 78 97  98  98
       97  58  98

In [95]:
examDF1.loc[('김재중', 78, 97)]

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_21756/3056540236.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF1.loc[('김재중', 78, 97)]

           영어  과학
이름  국어 수학
김재중 78 97  98  98
       97  58  98

In [96]:
# inplace 매개변수/파라미터 
# => 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False!!
examDF.rename(index={0:'zero'}, inplace=True)

In [97]:
examDF1.loc[('김재중', 78, 34)]

/var/folders/9y/lpn0hjmn5csct06t4_r5qtjr0000gn/T/ipykernel_21756/1482142610.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  examDF1.loc[('김재중', 78, 34)]

           영어  과학
이름  국어 수학
김재중 78 34  89  62

In [98]:
# KeyError 발생 
# examDF1.loc[(78)]

- 멀티인덱스에서 인덱스의 일부분을 기준으로 행을 선택 : xs
    * 예) '김재중', 78, 34 => Level 0, 1, 2

In [99]:
examDF1.xs('김재중')
#examDF1.xs('김재중', level=0)과 같은 값

       영어  과학
국어 수학
78 97  98  98
   97  58  98
   34  89  62

In [103]:
# examDF1.xs(97) 불가능
# examDF1.xs(97, level=1)      

# 질문 꼭 하기

- ('마징가', 98, 77), ('임꺽정', 100,72) 2개 행을 한꺼번에 가져오기

In [106]:
examDF1.loc[[('김재중', 78, 97), ('김현아', 89, 49)]]

           영어  과학
이름  국어 수학
김재중 78 97  98  98
       97  58  98
김현아 89 49  89  89

In [ ]:
examDF.columns

In [ ]:
examDF.rename(columns={'수학':'math'}, inplace=True)

In [ ]:
examDF

### <hr> (5) 인덱스 재배치 : 행/열 인덱스를 원하는 순서대로 재배치 + 존재하지 않는 행/열 추가
    * DF.reindex()

In [109]:
examDF

       이름  국어  수학  영어  과학
zero  김재중  78  97  98  98
1     김현아  89  49  89  89
2     조현아  99  89  39  79
3     이창민  29  99  49  89
4     김재중  78  97  58  98
5     김재중  78  34  89  62

In [110]:
print( examDF.index, examDF.columns, sep='\n\n')

Index(['zero', 1, 2, 3, 4, 5], dtype='object')

Index(['이름', '국어', '수학', '영어', '과학'], dtype='object')

- 컬럼명 순서 변경 ==> '체육', '미술', '국어', '수학', '총합'

In [123]:
examDF.reindex(['과학', '영어', '수학', '국어', '총합'], axis='columns', fill_value=0) 
#fill_value 값 안 주면 NaN뜸

      과학  영어  수학  국어  총합
zero  98  98  97  78   0
1     89  89  49  89   0
2     79  39  89  99   0
3     89  49  99  29   0
4     98  58  97  78   0
5     62  89  34  78   0

- 행 인덱스 재배치 0,2,4,1,3,5

In [124]:
examDF.reindex(['zero',2,4,1,3,5], axis='index', fill_value=0) 
#fill_value 값 안 주면 NaN뜸

       이름  국어  수학  영어  과학
zero  김재중  78  97  98  98
2     조현아  99  89  39  79
4     김재중  78  97  58  98
1     김현아  89  49  89  89
3     이창민  29  99  49  89
5     김재중  78  34  89  62

- 컬럼명 순서 변경 ==> '체육', '미술', '국어', '수학', '총합' + 행 인덱스 0,2,4,1,3,5 재배치

In [125]:
examDF.reindex(index=['zero',2,4,1,3,5], columns=['과학', '영어', '수학', '국어', '총합'], fill_value=0)

      과학  영어  수학  국어  총합
zero  98  98  97  78   0
2     79  39  89  99   0
4     98  58  97  78   0
1     89  89  49  89   0
3     89  49  99  29   0
5     62  89  34  78   0

In [ ]:
examDF

In [ ]:
# 2개의 칼럼을 행 인덱스 설정. 단, inplace 파라메터가 False로 원본에 적용 안 됨!
# examDF3 = examDF.set_index(['이름', '국어', '수학']) #이 버전에서 에러

In [ ]:
examDF2.index

In [ ]:
examDF2.loc['김재중']

In [ ]:
# examDF3 = examDF.set_index(['이름','국어','수학'])
# examDF3.index # 이 버전에서 에러

In [ ]:
# examDF3.loc['김재중']

In [ ]:
# KeyError => '김재중,78,98' 형식으로 78로 시작하는 Key 없음
# examDF3.loc[78,98] # 순차적으로 검색하기 때문에 '이름'없이 검색 시작이 안됨

### <hr> (5) 새로운 인덱스 설정 방법 3

In [ ]:
# 현재 행 인덱스 ==> 컬럼으로 추가
df1 = examDF.reset_index().reset_index()
df1

In [ ]:
# 현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2 = examDF.reset_index(drop=True)
df2